Repository: IliaTrofimov/PopulationModels
Catalog: PopulationModels.UI/Resources/Localization.*.resx
Languages: ru

# Algorithm
source: ODE Solver
ru: Алогритм

source: Bazykin
ru: Базыкин

# BazykinModel
source: Bazykin's model
ru: Модель Базыкина

# Bazykin_A
source: Reproduction rate of prey
ru: Скорость размножения жертв

# BazykinModelSmall
source: Bazykin's model (small)
ru: Модель Базыкина (малая)

# BazykinModelSunlight
source: Bazykin's model (sunlight)
ru: Модель Базыкина (освещённость)

# Bazykin_P
source: Population's growth threshold coefficient
ru: Коэффициент, ограничивающий рост популяции

# Bazykin_C
source: The death rate of predators in the absence of prey
ru: Смертность хищников в отсутствие добычи

source: Lotka-Volterra model
ru: Модель Лотки-Вольтерра

source: Language
ru: Язык

source: Max time
ru: Максимальное время

source: Initial values
ru: Нач. значения

# InitialPredator
source: Initial population of the predators
ru: Начальная полуляция хищников

# InitialPrey
source: Initial population of the prey
ru: Начальная популяция жертв

# InitialResource
source: Initial amount of resource
ru: Начальное количество ресурсов

source: Model
ru: Модель

# ModelParameters
source: Parameters
ru: Параметры

# Population
source: Population size
ru: Размер популяции

source: Predators
ru: Хищники

source: Prey
ru: Жертвы

source: Reset
ru: Сброс

source: Resource
ru: Ресурс

source: Sunlight
ru: Освещённость

source: Time
ru: Время

source: Time period
ru: Период смены дня/ночи

source: Time step
ru: Временной шаг

source: Update
ru: Обновить

# Bazykin_B
source: The death rate of prey from actions of predators
ru: Смертность жертв от дейтсвий хищников

# Bazykin_D
source: Reproduction rate of predators from eating prey
ru: Скорость размножения хищников при поедании жертв

# Bazykin_E
source: The death rate of prey from self-competition
ru: Смертность жертв под дейтвием конкуренции

# Bazykin_M
source: The death rate of predators from self-competition
ru: Смертность хищников под дейтвием конкуренции

# Bazykin_R
source: Prey's growth coefficient (resource based)
ru: Скорость размножения жертв под влияния ресурса

# Bazykin_A_decrease
source: Prey population is growing slower and can be overwhelmed by predators
ru: Скорость размножения жертв снижается, постепенно хищники могут истребить жерт

# Bazykin_A_increase
source: Prey population is growing faster and may withstand predators actions more efficiently
ru: Скорость размножения жертв возрастает, что компенсирует нападения хищников

# Bazykin_B_decrease
source: Prey population is less vulnurable to predators actions, population decay is slower
ru: Популяция жертв менее восприимчива к нападениям хищников, смертность снижается

# Bazykin_B_increase
source: Prey population is more vulnurable to predators actions, population decay is faster
ru: Популяция жертв более восприимчива к нападениям хищников, смертность повышается

# Bazykin_C_decrease
source: Predators population is starving slower and can hold on without prey longer
ru: Хищники голодают меньше и могут существовать дольше в отсутсвии жертв

# Bazykin_C_increase
source: Predators population is starving faster and can dying quicker without prey
ru: Хищники голодают сильнее и начинают быстрее умирать в остутсвии жертв

# Bazykin_E_decrease
source: The population suffers less from self-competition
ru: Популяция меньше страдает от внутренней конкуренции

# Bazykin_E_increase
source: The population suffers more from self-competition
ru: Популяция сильнее страдает от внутренней конкуренции

# Bazykin_A_zero
source: Prey population is not growing on its own
ru: Жертвы не размножаются

# Bazykin_B_zero
source: Prey population is invulnurable to predators actions, population will not decay (exponential growth is now possible)
ru: Популяция жертв не восприимчива к нападениям хищников и больше не вымирает (возможен экспоненциальный рост)

# Bazykin_C_zero
source: Predators population is not starving and dying without prey
ru: Хищники не голодают в отсутсвии жертв и не погибают от голода

# Bazykin_D_decrease
source: Predators population is growing slower from eating prey
ru: Скорость размножения хищников при поедании жертв уменьшается, хищники могут вымереть от голода

# Bazykin_D_increase
source: Predators population is growing faster from eating prey
ru: Скорость размножения хищников при поедании жертв уменьшается, что компенсирует голод

# Bazykin_D_zero
source: Predators population is not growing from eating prey (exponential decay)
ru: Хищники не размножаются при поедании жертв (экспоненциальное вымирание)

# Bazykin_E_zero
source: The population is not suffers from self-competition
ru: Популяция не испытывает внутреннюю конкуренцию

# BazykinModel_description
source: The predator-prey model by A. D. Bazykin, in contrast to the Lotka-Volterra model, takes into account additional factors affecting real predator-prey systems: the nonlinearity of the reproduction rate of the victim and competition within its population, the effect of saturation of the predator with the victim, competition of predators for victims, the nonlinear nature of the destruction of the victim by the predator and other effects.
ru: Модель "хищник-жертва" А. Д. Базыкина в отличие от модели Лотки-Вольтерра учитывает дополнительные факторы, влияющие на реальные системы хищник-жертва: нелинейность скорости размножения жертвы и конкуренцию внутри ее популяции, эффект насыщения хищника жертвой, конкуренцию хищников за жертв, нелинейный характер уничтожения жертвы хищником и иные эффекты.

# OdeParameters
source: ODE solver parameters
ru: Параметры алгоритма

# Info
source: Model information
ru: Информация о модели

# Presentation
source: Simulation
ru: Симуляция

# PlotType_phase
source: Phase plane
ru: Фазовый портрет

# PlotType_time
source: Population dynamics
ru: Популяция-время

# PlotType_phase_description
source: A single curve where each point represents the size of the prey (X axis) and predator (Y axis) population at a certain point in time.
ru: Кривая, каждая точка которой отображает размер популяции жертв (ось X) и хищников (ось Y) в определённый момент времени. Точки с меткой t=xxx обозначают время, в которое система имела состояние (x,y) соответсвующее этой точке.

# PlotType_time_description
source: The change in the populations of prey and predators over time is displayed as two independent curves on a two-dimensional plane, where time corresponds to the X axis and the population size corresponds to the Y axis.
ru: Изменение размеров популяций жертв и хищиков со временем отображаются как две независимые кривые на двумерной плоскости, где время соотвествует оси X, а размер популяции - оси Y.

# PlotType_phase_smalScatter
source: Eeach {0} step
ru: Каждый {0}-й шаг

source: Exit
ru: Завершить

source: About
ru: О программе

# Program
source: Program options
ru: Параметры программы

# About_title
source: Population dynamics
ru: Динамика популяций

# About_text
source: Population dynamics simulation with A. D. Bazykin "prey-predator" models.
ru: Симуляция эволюции биологических популяций с помощью моделей "хищник-жертва" А. Д. Базыкина.

# Title
source: Population Models
ru: Моделирование популяций

# About_author
source: Ilia Trofimov (github.com/IliaTrofimov)
ru: Илья Трофимов (github.com/IliaTrofimov)

# About_sources
source: https://moluch.ru/archive/106/25234
ru: Колпак, Е. П. О моделях А. Д. Базыкина «хищник — жертва» / Е. П. Колпак, Е. В. Горыня, Е. А. Селицкая. — Текст : непосредственный // Молодой ученый. — 2016. — № 2 (106). — С. 12-20. — URL: https://moluch.ru/archive/106/25234/
